[
    {
        "Trait ID": 1,
        "Question code": 1,
        "Question ": "The company has planned for a team outing after planning for 6 long months, but since you joined the company only a few weeks back they could not include you in the trip. What will be your emotional state?",
        "Option A": "Angry",
        "Option A Score": 0,
        "Option B": "Dejected",
        "Option B Score": 1,
        "Option C": "Feeling left alone",
        "Option C Score": 2,
        "Option D": "Neutral and practical",
        "Option D Score": 3
    },
    {
        "Trait ID": 1,
        "Question code": 2,
        "Question ": "You are supposed to finish work on a stipulated time, but due to real technical constraints, you fall back from your deadline. Before you inform your boss about this technical glitch he starts to think you have not done the work and starts to be harsh on you. How will you make him understand that it is not your fault?",
        "Option A": "Stop in the middle of the conversation and explain to him because if you keep on listening he might think that it's your fault and you are telling reasons for not finishing the work and it may affect your credibility",
        "Option A Score": 0,
        "Option B": "Inform the boss beforehand about the technical glitch so that he doesn't think that's because of your personal reason",
        "Option B Score": 1,
        "Option C": "Confront politely in the middle of the conversation and make sure you tell the reason and then continue the discussion",
        "Option C Score": 2,
        "Option D": "Listen calmly when your boss confronts you and at the end of the discussion make him understand the situation",
        "Option D Score": 3
    },
    {
        "Trait ID": 1,
        "Question code": 3,
        "Question ": "Unfortunately, there has been a fight over a decision between you and your co-worker. Immediately you are asked to work along with him on a certain work. What will you do?",
        "Option A": "Forget everything that has happened and work since work comes first in a workplace",
        "Option A Score": 0,
        "Option B": "Inform your supervisor you can't work as it may disrupt the work atmosphere and productivity",
        "Option B Score": 1,
        "Option C": "You will work but not feel comfortable once done is done",
        "Option C Score": 2,
        "Option D": "Reason out what the fight was about, talk to the person and see whether you can work out with him",
        "Option D Score": 3
    },
    {
        "Trait ID": 1,
        "Question code": 4,
        "Question ": "You have given the responsibility to your subordinate employee for sending a group mail for your esteemed claims, but he has left out certain information and sent the mail without proofreading. How will you rectify this problem?",
        "Option A": "Restrain yourself from giving him any further work of this nature",
        "Option A Score": 0,
        "Option B": "Give him an excuse with the last warning and make sure to proofread the next time and make things correct.",
        "Option B Score": 1,
        "Option C": "Take responsibility for the fault and re-send the mail to the clients.",
        "Option C Score": 2,
        "Option D": "Make him re-send the mail, by again proofreading the contents the mail",
        "Option D Score": 3
    },
    {
        "Trait ID": 1,
        "Question code": 5,
        "Question ": "You happen to be presenting to a huge crowd in an open auditorium. There are a group of co-workers in the crowd who are not on good terms with you. In the progress, of the presentation, they interfere in between and bring up questions that are relevant but it hinders the progress of the presentation. What will you do in that situation?",
        "Option A": "Choose not to answer and proceed with the presentation",
        "Option A Score": 0,
        "Option B": "Stop the presentation and answer the questions and proceed further",
        "Option B Score": 1,
        "Option C": "I will feel a slight discomfort as it hinders the process but I will maintain my composure and proceed with the presentation by answering the questions",
        "Option C Score": 2,
        "Option D": "Clarify that the questions will be answered at the end of the presentation",
        "Option D Score": 3
    },
    {
        "Trait ID": 1,
        "Question code": 6,
        "Question ": "You have been working in a place for almost 2 years now, and you are shifting to a company. While joining the company you are required to work with a senior manager of the firm for the next two months. What will you do in this situation?",
        "Option A": "Ask for a days time as you have to get used to the people and the workplace and start from Day 2",
        "Option A Score": 0,
        "Option B": "Adapt the situation and start working",
        "Option B Score": 1,
        "Option C": "Enquire your co-workers about the manager who you are going to work with and understand and make a judgment as to how you have to work with him",
        "Option C Score": 2,
        "Option D": "You’ll feel a sense of skittishness as it is your first day but will remain your composure and work along with the manager",
        "Option D Score": 3
    },
    {
        "Trait ID": 1,
        "Question code": 7,
        "Question ": "You are the boss of the firm. While conducting a weekly marketing meeting on Monday, you are discussing various tasks for the week ahead that has to be completed in two weeks' time by the end of the second week's Friday. After assigning all the tasks to your team members, one member of the team requests a week's leave for his sister's marriage, but he assures us that he will finish the work on time. But before the meeting, you discussed it with your team and asked whether they will able to finish the work in place of him and they obliged. What will you do in this situation?",
        "Option A": "Since it is an unplanned leave and it will affect the team performance, do not grant him the leave",
        "Option A Score": 0,
        "Option B": "Grant him the leave but tell him to work remotely and ensure that the work is done on time",
        "Option B Score": 1,
        "Option C": "Grant him only 50% of the requested leave days",
        "Option C Score": 2,
        "Option D": "Grant him the requested leave and give him a one-time exemption and split up his task among the other team members so that it can be finished on time.",
        "Option D Score": 3
    },
    {
        "Trait ID": 1,
        "Question code": 8,
        "Question ": "There has been a huge task being lined up for the next two weeks, you are in dire need of personal leave for the next week as it is your close relative's marriage. But your boss is about to assign you the responsibility in the team meeting to finish the work in the stipulated time. What will you do in this situation?",
        "Option A": "After the meeting, ask for a week's leave ensuring that you will finish the work on time",
        "Option A Score": 0,
        "Option B": "Ask for approval to share the workload with your team members and ensure that you will finish the task",
        "Option B Score": 1,
        "Option C": "Ask for permission to work remotely",
        "Option C Score": 2,
        "Option D": "Inform your boss about the situation and ask for leave beforehand",
        "Option D Score": 3
    },
    {
        "Trait ID": 1,
        "Question code": 9,
        "Question ": "You and your co-worker have been assigned a task. In that case, when there is a negative result to the task and you are not responsible for the fault only your co-worker is responsible for the fault but you are being sued for the task, what will you do in this situation?",
        "Option A": "Take responsibility, help in finishing, and assure the top-level management that this mistake won't happen again",
        "Option A Score": 0,
        "Option B": "Inform the top-level management that it is not your fault",
        "Option B Score": 1,
        "Option C": "Try to make up for the mistakes by helping him finish the tasks",
        "Option C Score": 2,
        "Option D": "Take responsibility as you both have been assigned the task",
        "Option D Score": 3
    },
    {
        "Trait ID": 1,
        "Question code": 10,
        "Question ": "Your office is in a coworking space, which has got lots of diverse companies on a single floor. You are there for almost 9 to 10 hours a day. There is space for isolation where you can work in silence and let no one disturb you. There is a pool table, foosball table, and a few board games where you can play. There is a couch where you can rest up for a while taking a break from your work schedule. And there is a bookshelf which offers you diverse books. How will you spend your absolutely free time in your workplace?",
        "Option A": "Go to the isolated room and spend time with work-related files.",
        "Option A Score": 0,
        "Option B": "Try to socialize with other people at the pool table or foosball table.",
        "Option B Score": 1,
        "Option C": "Read books in silence.",
        "Option C Score": 2,
        "Option D": "Take a break from the work schedule and rest up a while.",
        "Option D Score": 3
    }
,
    {
        "Trait ID": 2,
        "Question code": 11,
        "Question ": "You are entrusted with the task of conducting an important meeting at 10 am. At 7 am, you feel sick and don't know whether you would be able to conduct the meeting effectively. What would you do?",
        "Option A": "Inform the employer and the participants to reschedule the meeting to the next day since no option was available to conduct the meeting on the same day.",
        "Option A Score": 0,
        "Option B": "Ask an employee of your equal status in the company to replace you for the meeting",
        "Option B Score": 1,
        "Option C": "Be open to the employer in informing your situation, as conducting the meeting ineffectively will spoil your reputation as well as the company's reputation, and seek immediate replacement options",
        "Option C Score": 2,
        "Option D": "Go ahead as per the schedule and inform your employer after the meeting about your problem.",
        "Option D Score": 3
    },
    {
        "Trait ID": 2,
        "Question code": 12,
        "Question ": "You and your co-worker are required to work on a specific task by splitting the work equally and your co-worker has not done his assigned part of the work but it is your responsibility to hand over the finished document to the representative on time, what will you do to finish the work effectively.",
        "Option A": "favor your friend by taking up his task as yours and make the report on time",
        "Option A Score": 0,
        "Option B": "report to the higher authorities, since your reputation is at stake.",
        "Option B Score": 1,
        "Option C": "motivate the co-worker and get the work done effectively on time.",
        "Option C Score": 2,
        "Option D": "since you are known for your value of friendship help him in finishing the task so that you can submit the report on time",
        "Option D Score": 3
    },
    {
        "Trait ID": 2,
        "Question code": 13,
        "Question ": "A task has been delegated to your team and you are the leader of the team, where finishing your part of the work is important as the completion of the whole work depends on how you finish your specific task. Out of situations, you are not able to complete the work on time, what will you do?",
        "Option A": "Ask for the time from your employer citing the genuine situation and work on the goal to make it correct the next time.",
        "Option A Score": 0,
        "Option B": "Share the responsibility with your team, since the task must be completed as a team.",
        "Option B Score": 1,
        "Option C": "Even though the task has not been completed on time, try to work and finish it ASAP so that it will have no impact on the outcome.",
        "Option C Score": 2,
        "Option D": "Take responsibility as you are the leader of a team",
        "Option D Score": 3
    },
    {
        "Trait ID": 2,
        "Question code": 14,
        "Question ": "Your supervisor asks you to keep certain information confidential from the boss as it would affect your reputation but may have a negative effect on the company’s product.",
        "Option A": "Ask your close coworkers about the situation as it may give you clarity on what to decide with the information",
        "Option A Score": 0,
        "Option B": "You keep the information confidential since the supervisor has assured to take responsibility if anything negative happens",
        "Option B Score": 1,
        "Option C": "Behave ethically, as you are supposed to be following orders from your supervisor without questions asked, since that is your job description.",
        "Option C Score": 2,
        "Option D": "Even though your job is to follow your supervisor inform your boss about the confidential information.",
        "Option D Score": 3
    },
    {
        "Trait ID": 2,
        "Question code": 15,
        "Question ": "How do you carry out your daily activities in the workplace with the office timings that are from morning 10 am to evening 6 pm but offers you a flexible work time wherein you can choose any time to complete a specific task given to you.",
        "Option A": "Since your job requires only a weekly update make sure you finish your work by the end of the week by choosing work schedules as your comfortableness.",
        "Option A Score": 0,
        "Option B": "Be there on time sharp at 10 am and carry out the work so as you finish the work by closing time.",
        "Option B Score": 1,
        "Option C": "Arrive at the workplace a bit earlier so that you can get some time to relax and start your work for the day.",
        "Option C Score": 2,
        "Option D": "Choose your flexible work time to finish your work, but make sure you finish the day’s task",
        "Option D Score": 3
    },
    {
        "Trait ID": 2,
        "Question code": 16,
        "Question ": "When you are entrusted with a new work that you have not been assigned before, and you feel that the time is insufficient to do the work what will you do?",
        "Option A": "Ask the help of coworkers and try finishing the work",
        "Option A Score": 0,
        "Option B": "Turn down the work and ask them to assign it to a much more relevant person as it would affect productivity and also affect credibility",
        "Option B Score": 1,
        "Option C": "Accept the work and try to finish within the time frame",
        "Option C Score": 2,
        "Option D": "Request the employer to state the difficulty in work and ask the required time frame",
        "Option D Score": 3
    },
    {
        "Trait ID": 2,
        "Question code": 17,
        "Question ": "If you are one of the team members in a team of 8 and when asked about the opinion\/solution on a particular idea in general and you have conflicting ideas with the other team members how will you handle the situation?",
        "Option A": "Observe others' opinions and gather thoughts and work on them",
        "Option A Score": 0,
        "Option B": "Voice out your opinion and stand firmly on your decision without any changes as you are very confident in your decision",
        "Option B Score": 1,
        "Option C": "Wait for others' opinions and be considerate though they might be wrong to a certain extent.",
        "Option C Score": 2,
        "Option D": "You make changes in your decision and when you are proven that your opinion needs to be changed but it might have the same effect whether changed or not changed",
        "Option D Score": 3
    },
    {
        "Trait ID": 2,
        "Question code": 18,
        "Question ": "When you are absent from the workplace for a personal reason for a couple of weeks and you can't work even remotely for that specified time, how do you cope after the two weeks break?",
        "Option A": "Come back after the vacation and talk to your team members to know what has happened",
        "Option A Score": 0,
        "Option B": "Stay in touch with your coworkers as to what is going on in the office in your absence",
        "Option B Score": 1,
        "Option C": "Possibly try to get in touch with the team once in 3 days to know the happenings in the team",
        "Option C Score": 2,
        "Option D": "If you get a chance to work for a day in between, try to work remotely",
        "Option D Score": 3
    },
    {
        "Trait ID": 2,
        "Question code": 19,
        "Question ": "You are given a week's time to finish the task. But emergency situations arise where you will be absent for 2 days, what will you do to finish the work?",
        "Option A": "Inform the higher authorities that you'll be able to finish the work by taking 2 days extra citing your genuine personal reasons.",
        "Option A Score": 0,
        "Option B": "Try to work in a group for the time being so that you may finish the work on time.",
        "Option B Score": 1,
        "Option C": "Delegate your coworker friend who would do the work in place of you so that you can finish the work on time",
        "Option C Score": 2,
        "Option D": "Try to work a bit overtime on the days you are present so that you can have two days in hand for those emergency purposes",
        "Option D Score": 3
    },
    {
        "Trait ID": 2,
        "Question code": 20,
        "Question ": "Choose only one of the following situations where you feel the need to voice your opinion or take the right action in that instance.",
        "Option A": "When you see a blind person waiting to cross the road",
        "Option A Score": 0,
        "Option B": "When you see an animal being abused",
        "Option B Score": 1,
        "Option C": "When your superior tells a pregnant coworker to lift heavy boxes",
        "Option C Score": 2,
        "Option D": "When you are given some extra change by the cashier while buying in a grocery store.",
        "Option D Score": 3
    }
,
    {
        "Trait ID": 3,
        "Question code": 21,
        "Question ": "How often do you service the vehicle, and under what circumstances do you service, which is your only mode of transportation to and fro from the workplace to home?",
        "Option A": "Only when my mechanic is free as he knows much better about my vehicle than me",
        "Option A Score": 0,
        "Option B": "Drive as long as it runs and service it only when the need arises as time and money is an important criteria",
        "Option B Score": 1,
        "Option C": "Have my own criteria in mind as to when to service and do only at that time",
        "Option C Score": 2,
        "Option D": "Follow the regulations as per the user manual",
        "Option D Score": 3
    },
    {
        "Trait ID": 3,
        "Question code": 22,
        "Question ": "you are required to work on a special project which no one will supervise. You are completely responsible for the cause and effect of the project how will you ensure that you have done all the necessary corrective steps?",
        "Option A": "Have a friend lend a helping hand in order to finish the project",
        "Option A Score": 0,
        "Option B": "Finish the project and have a person review it.",
        "Option B Score": 1,
        "Option C": "Finish the project and check for any corrective measures over and over again.",
        "Option C Score": 2,
        "Option D": "Finish the project beforehand and look at the project a day after to get any possible ideas or corrections.",
        "Option D Score": 3
    },
    {
        "Trait ID": 3,
        "Question code": 23,
        "Question ": "You have three weeks' time to finish your work. The work consists of three tasks, how will you plan and split the work and finish it in three weeks' time?",
        "Option A": "Finish the three tasks in two weeks' time and take up another work in the remaining time",
        "Option A Score": 0,
        "Option B": "Split the three tasks among three weeks as each task for a week and complete it",
        "Option B Score": 1,
        "Option C": "Split three tasks over two weeks and keep the last week for review.",
        "Option C Score": 2,
        "Option D": "Finish your work as per your plan such that you have time for review and corrections.",
        "Option D Score": 3
    },
    {
        "Trait ID": 3,
        "Question code": 24,
        "Question ": "You are the team manager, how will you organize your team meeting?",
        "Option A": "have a discussion on the dates with the team and conduct the meeting as per the team's convenience",
        "Option A Score": 0,
        "Option B": "Conduct sudden meetings immediately so as to make a surprise check on the performance",
        "Option B Score": 1,
        "Option C": "Inform about the evening meeting in the morning which allows the team to get organized",
        "Option C Score": 2,
        "Option D": "Send a mail a week before and schedule the meeting by consulting everyone",
        "Option D Score": 3
    },
    {
        "Trait ID": 3,
        "Question code": 25,
        "Question ": "You are the team lead for a certain project, but you are out on personal leave on the day of submission. What will be the possible steps that you will make to ensure the completion of the project on time?",
        "Option A": "Tell the client the genuine reason for your absence, and request a later date for submission",
        "Option A Score": 0,
        "Option B": "Delegate the team member in place of you to complete the project on your behalf",
        "Option B Score": 1,
        "Option C": "Submit the project on the day before leaving for vacation",
        "Option C Score": 2,
        "Option D": "Possibly try managing the personal work after you have completed the project.",
        "Option D Score": 3
    },
    {
        "Trait ID": 3,
        "Question code": 26,
        "Question ": "You have a presentation due in 30 minutes. But still lack confidence in the contents of the presentation though you have revised it more than one time. But you still lack a sense of fulfillment. What will you do in this situation?",
        "Option A": "Reschedule it for a later time on the same day, since presenting without confidence might reflect on your personality.",
        "Option A Score": 0,
        "Option B": "For one last time discuss with your manager and see what can be done to be improved, because perfecting even at the last minute may help you",
        "Option B Score": 1,
        "Option C": "Discuss your problem with your co-worker and seek advice as it may boost your confidence levels",
        "Option C Score": 2,
        "Option D": "Proceed with the presentation neglecting all the doubts",
        "Option D Score": 3
    },
    {
        "Trait ID": 3,
        "Question code": 27,
        "Question ": "You are given a task to develop software that goes up for testing in a few days. Though you have finished the work you still feel there is space for improvement. How will you make the software much better",
        "Option A": "Take it to a person who is an immigrant to the software and explain to him and get his ideas on what he thinks",
        "Option A Score": 0,
        "Option B": "Take it to the higher authority and have him get looked into it.",
        "Option B Score": 1,
        "Option C": "Discuss with the other team members and look for glitches",
        "Option C Score": 2,
        "Option D": "Take time in reviewing all the processes done and repeat the step by step to achieve perfection",
        "Option D Score": 3
    },
    {
        "Trait ID": 3,
        "Question code": 28,
        "Question ": "In your workplace, there is a coffee machine wherein you can get coffee anytime. There is a rack where all the washed coffee cups are lined up. After you have finished the coffee you can leave the used mugs near the sink where most of the coworkers leave the cup, or on your work table itself where the up keepers clear the cup during the end of the day, or in a place that has been allotted for used coffee mugs which no one uses regularly. What will you do?",
        "Option A": "Depends on the place",
        "Option A Score": 0,
        "Option B": "Leave the mugs at the workplace that will be collected at the end of the day",
        "Option B Score": 1,
        "Option C": "Leave it near the sink where most of the coworkers keep the cups",
        "Option C Score": 2,
        "Option D": "Leave it in a place allotted for soiled mugs",
        "Option D Score": 3
    },
    {
        "Trait ID": 3,
        "Question code": 29,
        "Question ": "What is the most important thing according to you in finishing the tasks that have been given to you?",
        "Option A": "Delegating the work.",
        "Option A Score": 0,
        "Option B": "Reviewing with the higher authorities",
        "Option B Score": 1,
        "Option C": "Collaborative efforts",
        "Option C Score": 2,
        "Option D": "Perfectionism",
        "Option D Score": 3
    },
    {
        "Trait ID": 3,
        "Question code": 30,
        "Question ": "You are given an important task that has to be finished in 2 days. But you and the manager who gave you the work know that 2 days are not sufficient to finish the work what will you do in this situation?",
        "Option A": "Try at least completing half of the work so that you can show progress if not the work has been completed fully",
        "Option A Score": 0,
        "Option B": "Accept the work and try to complete it within two days",
        "Option B Score": 1,
        "Option C": "Collaborate with coworkers and finish the task in 2 days' time",
        "Option C Score": 2,
        "Option D": "Explain that two days is not sufficient and ask for the exact time to complete the work",
        "Option D Score": 3
    }
,
    {
        "Trait ID": 4,
        "Question code": 31,
        "Question ": "You are attending a group discussion for an interview. There is a topic that is in the discussion. In the process of discussion, you notice that there are some subtle offensive comments being told. How will you react to the situation?",
        "Option A": "Do not interrupt as it may bring a bad impression on you since it is a group discussion.",
        "Option A Score": 0,
        "Option B": "Inform the organizer about the derogatory comments made during the group discussions.",
        "Option B Score": 1,
        "Option C": "Note the person making offensive comments and after the meeting confront them personally.",
        "Option C Score": 2,
        "Option D": "Interrupt and tell that the comments are offensive.",
        "Option D.1": "Interrupt and tell that the comments are offensive."
    },
    {
        "Trait ID": 4,
        "Question code": 32,
        "Question ": "In a team meeting when you are discussing a certain process. Your boss gives an opinion in the meeting and tries to convince you that the idea would work. But deep down you have an opinion that contradicts your boss. What will you do in this situation?",
        "Option A": "Since he is the boss and it is his decision, in the end, do what he says.",
        "Option A Score": 0,
        "Option B": "Give your opinion to your boss at the end of the discussion in person",
        "Option B Score": 1,
        "Option C": "Discuss it with your co-workers on the opinion and decide what to do",
        "Option C Score": 2,
        "Option D": "Voice out your opinion as it may be constructive in the progress of the possess",
        "Option D.1": "Voice out your opinion as it may be constructive in the progress of the possess"
    },
    {
        "Trait ID": 4,
        "Question code": 33,
        "Question ": "What is your opinion of a fun Friday activity that most big companies enforce on the employees for one solid hour on a Friday evening?",
        "Option A": "It improves team building since you get a chance to interact with team members in a friendly manner",
        "Option A Score": 0,
        "Option B": "Suggest other options in place of the fun Friday activity",
        "Option B Score": 1,
        "Option C": "Suggests changes in the activity as it needs improvement",
        "Option C Score": 2,
        "Option D": "Preparation for those events takes up a certain time of the schedule and hence can be avoided",
        "Option D.1": "Preparation for those events takes up a certain time of the schedule and hence can be avoided"
    },
    {
        "Trait ID": 4,
        "Question code": 34,
        "Question ": "You are in a big firm. A team of members is working on a project. In the progress of the meeting, you notice the employee making a mistake and proceeding with it. You can see that it hinders the process of the project. What will you do in this situation?",
        "Option A": "Choose to ignore it as you are minding your own business.",
        "Option A Score": 0,
        "Option B": "Discuss with the team members and make the person correct it.",
        "Option B Score": 1,
        "Option C": "Notice the mistake and inform your team leader.",
        "Option C Score": 2,
        "Option D": "Stop them and tell them that they are doing a mistake and make them correct it.",
        "Option D.1": "Stop them and tell them that they are doing a mistake and make them correct it."
    },
    {
        "Trait ID": 4,
        "Question code": 35,
        "Question ": "Depression and emotional instability can be occurring to anyone at any time. For instance, you are feeling emotionally unstable all of a sudden by the time you are going to the office. You feel that even going to the office you will not be able to work productively. What will you do in this situation?",
        "Option A": "Go to the office anyway",
        "Option A Score": 0,
        "Option B": "Without telling the reason take a sick leave",
        "Option B Score": 1,
        "Option C": "Request a day to work from home",
        "Option C Score": 2,
        "Option D": "Inform your situation and request a day off",
        "Option D.1": "Inform your situation and request a day off"
    },
    {
        "Trait ID": 4,
        "Question code": 36,
        "Question ": "You and your team are meeting for a team dinner. It is supposed to be an informal meeting and meant for team building. In that meeting out of the blue one of the superiors start making comments about one of your coworkers that kind of seemed to be humiliating from your point of view.",
        "Option A": "Stay silent as it is none of your concern to interfere as long as the comments are pointed towards you",
        "Option A Score": 0,
        "Option B": "Express discomfort and leave the dinner in between.",
        "Option B Score": 1,
        "Option C": "Call the person personally and tell them that their comments were humiliating after the end of the dinner.",
        "Option C Score": 2,
        "Option D": "Support your coworker, tell them that their comment is humiliating and this is team dinner, not a formal team meeting on the spot.",
        "Option D.1": "Support your coworker, tell them that their comment is humiliating and this is team dinner, not a formal team meeting on the spot."
    },
    {
        "Trait ID": 4,
        "Question code": 37,
        "Question ": "There is a new project that is lining up. You are about to be put up in the team for the project. That project requires a set of new skills to be learned that will take up some time. How will you handle the situation?",
        "Option A": "Take help from your coworkers who have knowledge of the subject, and continue working on the project",
        "Option A Score": 0,
        "Option B": "Request your boss to find a replacement for the project as it would affect the progress of the project",
        "Option B Score": 1,
        "Option C": "Tell the boss that you require time to learn the skills so that you can work on the project",
        "Option C Score": 2,
        "Option D": "Be open, and express that you don't have the required skills to work on them",
        "Option D.1": "Be open, and express that you don't have the required skills to work on them"
    },
    {
        "Trait ID": 4,
        "Question code": 38,
        "Question ": "Certain situations require you to be frank and open, but it may end up hurting someone or a group of people in the progress. But deep down you know that you will be making the right choice by being open and frank. Do you feel that being open in this situation is the best possible option?",
        "Option A": "Disagree",
        "Option A Score": 0,
        "Option B": "Depends on the people around",
        "Option B Score": 1,
        "Option C": "Depends on the situation",
        "Option C Score": 2,
        "Option D": "Agree",
        "Option D.1": "Agree"
    },
    {
        "Trait ID": 4,
        "Question code": 39,
        "Question ": "Your company is facing a crisis, you are responsible for maintaining peace in the workplace. You will not be able to pay the employees for a brief period of 2 months. But after that, you will be paying them in full. What will be your course of action in this situation?",
        "Option A": "Choose not to tell, since you are the boss and can explain them later when asked.",
        "Option A Score": 0,
        "Option B": "Just blankly tell them, that salary won't be given and assure them it will be paid in full after.",
        "Option B Score": 1,
        "Option C": "Inform about the situation of the company to your employees, make them understand what your company is going through and inform them salary will be given only after 2 months",
        "Option C Score": 2,
        "Option D": "Conduct a team meeting and discuss all the possible options for either getting out of this situation or how to handle the situation and understand the employees' mindset on the current situation.",
        "Option D.1": "Conduct a team meeting and discuss all the possible options for either getting out of this situation or how to handle the situation and understand the employees' mindset on the current situation."
    },
    {
        "Trait ID": 4,
        "Question code": 40,
        "Question ": "Your boss in person asks you about a certain decision. He also discusses the decision that he has in his mind. After listening to that you feel a slight change in the decision must be a better option. What will be your decision in a situation like this?",
        "Option A": "Choose not to tell anything differing from his decisions, as he is the boss and it is his decision",
        "Option A Score": 0,
        "Option B": "Discuss this with your other team members and then convey your decision to your boss.",
        "Option B Score": 1,
        "Option C": "Listen and ask for time to think about it and tell it later on",
        "Option C Score": 2,
        "Option D": "Immediately tell that you differ from the opinion and tell your thoughts.",
        "Option D.1": "Immediately tell that you differ from the opinion and tell your thoughts."
    }
,
    {
        "Trait ID": 5,
        "Question code": 41,
        "Question ": "A worker is constantly being late to work, but he\/she finishes the task given to her in the specified time and always be on time in submitting the work. Though this is good but since it disturbs team balance they had to let go of the person for the betterment of the company. What is your take on this?",
        "Option A": "Considering the betterment of the company laying them off is a good option",
        "Option A Score": 0,
        "Option B": "You could have spoken to them personally and made them realize",
        "Option B Score": 1,
        "Option C": "Should have revamped the time working hours and made them a rule",
        "Option C Score": 2,
        "Option D": "The top management should have spoken to them and made them understand and should have tried correcting them",
        "Option D Score": 3
    },
    {
        "Trait ID": 5,
        "Question code": 42,
        "Question ": "You are requesting your boss to make work from home assuring that you will finish the work by the end of the day, but due to unavoidable circumstances, you are able to finish only 50 % of the work. How will you ensure to finish the work on time?",
        "Option A": "Request a day's time since it is really difficult to perform the task on time.",
        "Option A Score": 0,
        "Option B": "Request your co-worker to help you in finishing the task",
        "Option B Score": 1,
        "Option C": "Request the boss for additional time on the same day and finish it by the end of the day.",
        "Option C Score": 2,
        "Option D": "Rush up and work without a break and submit the report on time",
        "Option D Score": 3
    },
    {
        "Trait ID": 5,
        "Question code": 43,
        "Question ": "Your senior manager tells you to hide certain sensitive information from your boss as that information would cause cost the company negatively. What do you think is the best possible thing to do?",
        "Option A": "Discuss with the co-worker, and ask their opinion on this.",
        "Option A Score": 0,
        "Option B": "Follow the directions as you are answerable to the senior manager.",
        "Option B Score": 1,
        "Option C": "Ignore the manager's directions and tell the boss since the company’s betterment is your interest.",
        "Option C Score": 2,
        "Option D": "Think over it again and tell the manager that since the information is going to cost it's better you directly tell the boss.",
        "Option D Score": 3
    },
    {
        "Trait ID": 5,
        "Question code": 44,
        "Question ": "Do you think it is reasonable for the company to lay off an employee without listening to their part of the explanation since it is in the company’s policy to sack the employees without prior notice?",
        "Option A": "Reasonable",
        "Option A Score": 0,
        "Option B": "Not Reasonable",
        "Option B Score": 1,
        "Option C": "Employees should have been given a chance",
        "Option C Score": 2,
        "Option D": "Should have listened to the employee's explanation",
        "Option D Score": 3
    },
    {
        "Trait ID": 5,
        "Question code": 45,
        "Question ": "For technology-based companies, WFH is the best option since everything is online",
        "Option A": "Disagree",
        "Option A Score": 0,
        "Option B": "Depends on the situation\/project",
        "Option B Score": 1,
        "Option C": "Strongly agree",
        "Option C Score": 2,
        "Option D": "Agree",
        "Option D Score": 3
    },
    {
        "Trait ID": 5,
        "Question code": 46,
        "Question ": "You know that you will be able to finish the task on time. But your company policy instructs you to stay in the office for a definite amount of time. But due to your personal constraints, you need to have flexible work timings. What will you do?",
        "Option A": "Understand that you have accepted the company’s policy and work as per schedule.",
        "Option A Score": 0,
        "Option B": "since you cannot be productive as it hinders your personal life, look for a change of workplace.",
        "Option B Score": 1,
        "Option C": "Explain to the manager about your personal constants and request flexible work timings.",
        "Option C Score": 2,
        "Option D": "Request for a WFH option, as you can be productive both professionally and personally",
        "Option D Score": 3
    },
    {
        "Trait ID": 5,
        "Question code": 47,
        "Question ": "Do you feel that ID cards are necessary to wear around the neck always?",
        "Option A": "Disagree",
        "Option A Score": 0,
        "Option B": "Personal choice",
        "Option B Score": 1,
        "Option C": "Agree",
        "Option C Score": 2,
        "Option D": "Produce when demanded",
        "Option D Score": 3
    },
    {
        "Trait ID": 5,
        "Question code": 48,
        "Question ": "The project has to be submitted by Monday and it is Friday today. Still, the work hasn't been completed and it at least requires 2 days for completion. Your boss requests you to work on the weekends to finish the work and it is a mid-sized company. What will be your response in this situation?",
        "Option A": "Ask your boss to put some of your co-workers to help you out with the project.",
        "Option A Score": 0,
        "Option B": "Request a compensation of leave for the two days afterward.",
        "Option B Score": 1,
        "Option C": "Work as requested since you know the importance of the project.",
        "Option C Score": 2,
        "Option D": "since you have planned for that particular weekend almost 2 months back and since it will affect your personal life reason it out to your boss and request a change in person to do the work.",
        "Option D Score": 3
    },
    {
        "Trait ID": 5,
        "Question code": 49,
        "Question ": "Surprisingly your boss asks you a personal question that is completely irrelevant to the work situation. How will you respond?",
        "Option A": "Since he is not going to know about it, fake the information",
        "Option A Score": 0,
        "Option B": "Talk in detail about the question asked",
        "Option B Score": 1,
        "Option C": "Choose to ignore the question",
        "Option C Score": 2,
        "Option D": "Restrain some information as it is completely unnecessary",
        "Option D Score": 3
    },
    {
        "Trait ID": 5,
        "Question code": 50,
        "Question ": "You are in a danger, and there are three other people with you in the situation. An old man, an infant, and a young man. You can save only one person other than saving yourself. Who would be your choice?",
        "Option A": "Save yourself first",
        "Option A Score": 0,
        "Option B": "The old man",
        "Option B Score": 1,
        "Option C": "Infant",
        "Option C Score": 2,
        "Option D": "A young man",
        "Option D Score": 3
    }
,
    {
        "Trait ID": 6,
        "Question code": 51,
        "Question ": "Your boss has given you a task but has not given a time limit for you to finish the task and has not given you any directions as to how to finish the task. How will you proceed with the task?",
        "Option A": "Finish the work and inform the boss only when asked from you while you carry on with other works.",
        "Option A Score": 0,
        "Option B": "Regularly inform him about the progress of the task given",
        "Option B Score": 1,
        "Option C": "Finish the task by defining your own deadline.",
        "Option C Score": 2,
        "Option D": "Ask the boss when to finish it and plan accordingly.",
        "Option D Score": 3
    },
    {
        "Trait ID": 6,
        "Question code": 52,
        "Question ": "Your company changes the policy of WFH from 3 days a week to 1 day a week citing the necessity for collaboration of ideas happens more when meeting in person, your opinion on this.",
        "Option A": "Disagree",
        "Option A Score": 0,
        "Option B": "Depending on the purpose",
        "Option B Score": 1,
        "Option C": "Agree",
        "Option C Score": 2,
        "Option D": "Agree but question the necessity",
        "Option D Score": 3
    },
    {
        "Trait ID": 6,
        "Question code": 53,
        "Question ": "For a certain job to be done, you feel that following the rules might not be the best feasible option, only by bending the rule, you will be able to finish the task. What will you do in this situation?",
        "Option A": "DIY",
        "Option A Score": 0,
        "Option B": "Be flexible and finish the task, and then inform the top management.",
        "Option B Score": 1,
        "Option C": "Consult with the top management",
        "Option C Score": 2,
        "Option D": "Follow the rules",
        "Option D Score": 3
    },
    {
        "Trait ID": 6,
        "Question code": 54,
        "Question ": "Your company keeps on changing the work policies so frequently, and your co-worker complains about this to you, what do you feel about this?",
        "Option A": "Express high acceptableness as it disrupts working patterns frequently.",
        "Option A Score": 0,
        "Option B": "Accept the distress and support them in their thoughts",
        "Option B Score": 1,
        "Option C": "Find the complaint unreasonable",
        "Option C Score": 2,
        "Option D": "Advice to follow since it is the company’s rule",
        "Option D Score": 3
    },
    {
        "Trait ID": 6,
        "Question code": 55,
        "Question ": "In case the traffic signals color coding has been changed to green is for stop, yellow is to go and red is to proceed cautiously for one single day.",
        "Option A": "Abide by the old color coding",
        "Option A Score": 0,
        "Option B": "Unsure",
        "Option B Score": 1,
        "Option C": "Since you have been following the old color coding you tend to forget it at times and follow the old color pattern.",
        "Option C Score": 2,
        "Option D": "Follow the new color coding",
        "Option D Score": 3
    },
    {
        "Trait ID": 6,
        "Question code": 56,
        "Question ": "When you are about to make an u-turn in oncoming traffic where the U-turn is not allowed. How will you proceed cautiously in the situation?",
        "Option A": "Indicate that you are turning and proceed cautiously.",
        "Option A Score": 0,
        "Option B": "Hand signal and put indicators and turn and turn cautiously",
        "Option B Score": 1,
        "Option C": "Wait for the oncoming vehicle to reduce, indicate, and then take the turn",
        "Option C Score": 2,
        "Option D": "Avoid taking the turn",
        "Option D Score": 3
    },
    {
        "Trait ID": 6,
        "Question code": 57,
        "Question ": "Your office requires you to come to the office on time even on rainy days when commuting gets difficult. What do you think?",
        "Option A": "Not acceptable",
        "Option A Score": 0,
        "Option B": "Possibly opt for work from home, as it saves time and increases productivity",
        "Option B Score": 1,
        "Option C": "I will be asking for permission to come a bit late",
        "Option C Score": 2,
        "Option D": "Acceptable",
        "Option D Score": 3
    },
    {
        "Trait ID": 6,
        "Question code": 58,
        "Question ": "Have you heard of the circumstances where certain offices have a rule that does not allow the usage of personal communication devices during office hours since they work on a compassionate project? Do you think that is reasonable?",
        "Option A": "Strongly disagree",
        "Option A Score": 0,
        "Option B": "Disagree",
        "Option B Score": 1,
        "Option C": "Agreeable depending on the situation",
        "Option C Score": 2,
        "Option D": "Agree",
        "Option D Score": 3
    },
    {
        "Trait ID": 6,
        "Question code": 59,
        "Question ": "Your boss gives you a job that has to be done only by you and not give it to your subordinates. But since you are occupied with loads of work what will you do?",
        "Option A": "Assign the work to the subordinate since you are the boss.",
        "Option A Score": 0,
        "Option B": "Inform the boss that you need help and can't work alone on the task.",
        "Option B Score": 1,
        "Option C": "Collaborate on the work with your subordinate",
        "Option C Score": 2,
        "Option D": "Do the work as instructed",
        "Option D Score": 3
    },
    {
        "Trait ID": 6,
        "Question code": 60,
        "Question ": "The covid cases are decreasing but as a precautionary measure, the government has issued a statement regarding the compulsory wearing of masks, while at the workplace, while commuting by bike or car, or in any other public places and also issued a statement imposing Rs.500 fine if masks are worn at all the times. What is your opinion on this?",
        "Option A": "You were maks only when someone insists as you don't see anyone wearing masks voluntarily",
        "Option A Score": 0,
        "Option B": "Since no one is going to ask in your workplace to wear a mask, wear masks while commuting.",
        "Option B Score": 1,
        "Option C": "Since you feel a car is a closed commuting mode, restrict yourself from wearing masks inside the car alone",
        "Option C Score": 2,
        "Option D": "Wear masks as instructed in public places and while traveling.",
        "Option D Score": 3
    }
,
    {
        "Trait Id": 7,
        "Question code": 61,
        "Question ": "You and your coworker join the firm on the same day, you both are equally talented, but you get promoted to the senior manager but he still remains the junior manager and has to report to you. The reason for him being in the same position is because of his attitude but he thinks of you as a rival and you are the reason for him being sidelined. Now your superior gives you work that involves both of you to work together and get the work done, how will you get the work done?",
        "Option A": "Just direct him to do the work as he is your subordinate",
        "Option A Score": 0,
        "Option B": "Since you are the senior manager make a team and get the work done",
        "Option B Score": 1,
        "Option C": "Motivate him to work together on this by giving him incentives",
        "Option C Score": 2,
        "Option D": "Make him understand that this work has to be done by both of you and get the work done",
        "Option C Score.1": 3
    },
    {
        "Trait Id": 7,
        "Question code": 62,
        "Question ": "What do you think is the most productive way of delivering the expected result in the stipulated time in a huge organization?",
        "Option A": "Implementation of organizational hierarchy",
        "Option A Score": 0,
        "Option B": "Delegation and direction",
        "Option B Score": 1,
        "Option C": "Conditional incentives",
        "Option C Score": 2,
        "Option D": "Collaboration and teamwork.",
        "Option C Score.1": 3
    },
    {
        "Trait Id": 7,
        "Question code": 63,
        "Question ": "You need to put up a team for the next big task that is coming up. How will you form a team and on what basis will you be choosing the team for the specified task?",
        "Option A": "since everyone is able to perform at the same level, choose randomly on a trial and error basis",
        "Option A Score": 0,
        "Option B": "Choose the people who you are comfortable working with as it may be the best move in delegating the tasks",
        "Option B Score": 1,
        "Option C": "Choose people based on their level of expertise from different levels of the organizational hierarchy.",
        "Option C Score": 2,
        "Option D": "You have got several functional teams already, choose the required number of employees from each team and make a new team who would be effective in carrying out the tasks",
        "Option C Score.1": 3
    },
    {
        "Trait Id": 7,
        "Question code": 64,
        "Question ": "Do you feel that collaboration increases?   a. Productivity b. employee realationship",
        "Option A": "Neither A nor B",
        "Option A Score": 0,
        "Option B": "Only B",
        "Option B Score": 1,
        "Option C": "Only A",
        "Option C Score": 2,
        "Option D": "Both A and B",
        "Option C Score.1": 3
    },
    {
        "Trait Id": 7,
        "Question code": 65,
        "Question ": "You are carrying out research on a new scientific compound that when developed would help mankind in a highly positive way. Unfortunately, you can carry out the testing of the product only for certain parameters in your laboratory. But you find a similar work being carried out in a different university, in a different country. How will you manage to get the work done effectively?",
        "Option A": "Pay for the analysis alone and get the work done",
        "Option A Score": 0,
        "Option B": "Collaborate the work with them by giving credit to your findings",
        "Option B Score": 1,
        "Option C": "Use the barter system, get your work done from them, and in return owe them a favor of a similar nature",
        "Option C Score": 2,
        "Option D": "Give them co-authorship in the research paper that is going to be published based on the research.",
        "Option C Score.1": 3
    },
    {
        "Trait Id": 7,
        "Question code": 66,
        "Question ": "Two of your co-worker have a conflict of interest in an idea and you are the boss. They come up with their ideas individually and tell you their ideas. Unfortunately, both of them are correct and need to be carried on for effective delivery of the product. But they don't seem to like each other. What will be your move?",
        "Option A": "Weigh the ideas based on the expertise and move on with the best idea possible",
        "Option A Score": 0,
        "Option B": "Tell them to work together no questions asked",
        "Option B Score": 1,
        "Option C": "Collaborate with the two of them to work and report to you directly so that you can oversee each move",
        "Option C Score": 2,
        "Option D": "Tell them an experience from your days on how working together benefits and ask them to work on the task",
        "Option C Score.1": 3
    },
    {
        "Trait Id": 7,
        "Question code": 67,
        "Question ": "You have been dumping waste in a certain open space for years together. But it is not only you, but your neighbor has also been dumping in the same place as you are. Now that you are required to clean based on the instructions from the government.",
        "Option A": "See the situation is the neighbor is not taking action wait for them to do it first",
        "Option A Score": 0,
        "Option B": "Remove what you have littered and leave the rest as it is not your responsibility for the whole thing",
        "Option B Score": 1,
        "Option C": "Inform the authorities and accept the fact that if everyone gets involved you will also do your part",
        "Option C Score": 2,
        "Option D": "Talk with the neighbor and work together on the clean-up",
        "Option C Score.1": 3
    },
    {
        "Trait Id": 7,
        "Question code": 68,
        "Question ": "You are working on something that needs to be completed at the end of the week. Suddenly a coworker is asking for help with some of his tasks. He is asking for help not because he is not competent in doing the work himself. He is asking just because his deadline is nearing and he cannot complete the task on time. What will you do in this situation?",
        "Option A": "Turn down his request and ask him to try with another coworker",
        "Option A Score": 0,
        "Option B": "Consult with the boss whether you can work along with him and do as instructed",
        "Option B Score": 1,
        "Option C": "Since you are already occupied with your work, request another coworker on his behalf and get the work done",
        "Option C Score": 2,
        "Option D": "Work with him since you understand his situation and complete the work",
        "Option C Score.1": 3
    },
    {
        "Trait Id": 7,
        "Question code": 69,
        "Question ": "A task is assigned to your co-worker and he\/she asks for your help in finishing the task since the schedule is very limited. What will you do in this situation?",
        "Option A": "You will not be able to help since you will be occupied with your own tasks",
        "Option A Score": 0,
        "Option B": "Refer someone else to whom they can ask for help",
        "Option B Score": 1,
        "Option C": "Help them, but limit yourself by taking half of the task",
        "Option C Score": 2,
        "Option D": "Help them with the task, so that they would help you when you are in a crisis. ",
        "Option C Score.1": 3
    },
    {
        "Trait Id": 7,
        "Question code": 70,
        "Question ": "You have two job offers from two companies. the company which is flexible and promotes teamwork offers you a lesser salary package than the company which is rigid in the rules. what will you choose? ",
        "Option A": "Look for additional job offers, that you might get.",
        "Option A Score": 0,
        "Option B": "Choose the highest paying job straightaway.",
        "Option B Score": 1,
        "Option C": "Weigh out your pros and cons and choose the offer that would be best suitable for you.",
        "Option C Score": 2,
        "Option D": "Choose the company with the low salary package, since it offers you a teamworking environment",
        "Option C Score.1": 3
    }
,
    {
        "Trait ID": 8,
        "Question code": 71,
        "Question ": "In case you are driving on a single-lane road on a highway, you see a vehicle approaching on the opposite lane, where overtaking is not allowed, what will you do in this situation?  ",
        "Option A": "Since overtaking is not allowed pedal down on the gas and force the oncoming driver to hit the brakes",
        "Option A Score": 0,
        "Option B": "Turn on the blinker and proceed ahead with the oncoming traffic",
        "Option B Score": 1,
        "Option C": "Hit the brakes and allow the on coming driver to pass by ",
        "Option C Score": 2,
        "Option D": "Assess the SSD and stop or proceed with in the oncoming traffic",
        "Option D Score": 3
    },
    {
        "Trait ID": 8,
        "Question code": 72,
        "Question ": "In a workplace, where inclusivity is the main face of the organization, you tend to notice injustice and omission towards certain communities of people, what will be the state of mind and reaction to the issue? ",
        "Option A": "Since you are not in one of the affected groups you choose to remain silent as it would disturb the peace of all the people in the workplace",
        "Option A Score": 0,
        "Option B": "Call the person who is responsible for the happenings in the organization separately and let them understand the situation and warn them if the same thing continues you will inform to the boss",
        "Option B Score": 1,
        "Option C": "Talk to the super boss of the organization and let them know about the persisting situation and see that the situation is handled ",
        "Option C Score": 2,
        "Option D": "Confront the person who is wrongfully treating a certain communituy immediately on the spot irrespective of the surroundings and make them clear that their behavior and attitude are unacceptable.",
        "Option D Score": 3
    },
    {
        "Trait ID": 8,
        "Question code": 73,
        "Question ": "The boss favors certain people in the organization and offers them certain privileges and incentives beyond their ability and undermines certain people even though they are working hard and delivering results as expected, how will you approach this situation?     ",
        "Option A": "Stay silent as it is not affecting you in any way, and carry on with the work ",
        "Option A Score": 0,
        "Option B": "Talk with the boss separately and make him understand the sitaution since others are not feeling comfortable with their attitude",
        "Option B Score": 1,
        "Option C": "Discuss with your co-workers whether to approach the boss or not since it would jeopardize others situations as well.",
        "Option C Score": 2,
        "Option D": "Tell the boss about communism in the workplace is much needed, and point out to them that what they are doing is wrong.",
        "Option D Score": 3
    },
    {
        "Trait ID": 8,
        "Question code": 74,
        "Question ": "There is a leud sexist comment that is made about you behind your back, but you come to know about it through the word of mouth from some other person, how will you react in this situation?",
        "Option A": "Since the comment was made behind your back, and you don't know whether the person has made the comment or not let it go and carry on with the day",
        "Option A Score": 0,
        "Option B": "cross check with your other coworkers whether the accusations are correct and then decide what to do.",
        "Option B Score": 1,
        "Option C": "Confront the person who made the comment and warn them giving the last warning, and  inform them that if the same thing happens again you will complain to the boss.",
        "Option C Score": 2,
        "Option D": "Since you surely know that the comment is about you, ask the person on the face and go ahead in complaining to the boss straight away.",
        "Option D Score": 3
    },
    {
        "Trait ID": 8,
        "Question code": 75,
        "Question ": "You happen to see a person abusing a dog on the street, when you are passing by on the street, what will you do to handle the situation?",
        "Option A": "Since you have an important meeting to catch up on, leave the place and think of what to do afterward",
        "Option A Score": 0,
        "Option B": "move away from the situation and inform the authorities without revealing you identity",
        "Option B Score": 1,
        "Option C": "stop the person and warn him, if they are not listening inform the authorities and see that the action is taken against them",
        "Option C Score": 2,
        "Option D": "Stop the person right there and inform the authorities and see that necessary action is taken against the person ",
        "Option D Score": 3
    },
    {
        "Trait ID": 8,
        "Question code": 76,
        "Question ": "In a conference call with all your coworkers, at one point in time, a coworker who is also a close friend of you has made a leud comment that makes you uncomfortable, how will you handle the situation?",
        "Option A": "since he is your friend leave it as it is on the call and talk to him later ",
        "Option A Score": 0,
        "Option B": "convey the discomfort in a polite way since he is your friend and continue with the call",
        "Option B Score": 1,
        "Option C": "convey the discomfort in a strict way and shut them on the call and continue with the call",
        "Option C Score": 2,
        "Option D": "tell that you are uncomfortable with the comment that he made and exit the call immediately ",
        "Option D Score": 3
    },
    {
        "Trait ID": 8,
        "Question code": 77,
        "Question ": "There is a fire exit in your company that does not have a sign stating that you cannot use it unless in case of fire. You have been using the exit for months, suddenly a worker tells you that you should not use the exit, even though there is no clear sign stoping you from using the exit. what will you do?",
        "Option A": "Since there is no sign stopping you, continue using the exit.",
        "Option A Score": 0,
        "Option B": "use ",
        "Option B Score": 1,
        "Option C": null,
        "Option C Score": 2,
        "Option D": null,
        "Option D Score": 3
    },
    {
        "Trait ID": 8,
        "Question code": 78,
        "Question ": null,
        "Option A": null,
        "Option A Score": 0,
        "Option B": null,
        "Option B Score": 1,
        "Option C": null,
        "Option C Score": 2,
        "Option D": null,
        "Option D Score": 3
    },
    {
        "Trait ID": 8,
        "Question code": 79,
        "Question ": null,
        "Option A": null,
        "Option A Score": 0,
        "Option B": null,
        "Option B Score": 1,
        "Option C": null,
        "Option C Score": 2,
        "Option D": null,
        "Option D Score": 3
    },
    {
        "Trait ID": 8,
        "Question code": 80,
        "Question ": null,
        "Option A": null,
        "Option A Score": 0,
        "Option B": null,
        "Option B Score": 1,
        "Option C": null,
        "Option C Score": 2,
        "Option D": null,
        "Option D Score": 3
    }
]